# -*- ii: y; -*-
#+TITLE: apisnoop conformance test writing config

* exploring the tmate deployment

  #+begin_src shell
    lsof -i -n -P 2>&1
    :
  #+end_src

  #+RESULTS:
  #+begin_example
  COMMAND   PID USER   FD   TYPE     DEVICE SIZE/OFF NODE NAME
  tmate      95   ii    6u  IPv4 2625393319      0t0  TCP 10.244.1.2:47424->157.230.72.130:22 (ESTABLISHED)
  tmate     147   ii   11u  IPv4 2625297131      0t0  TCP 10.244.1.2:47686->157.230.72.130:22 (ESTABLISHED)
  tilt    44945   ii    5u  IPv4 2627038037      0t0  TCP 10.244.1.2:56870->10.96.0.1:443 (ESTABLISHED)
  tilt    44945   ii   17u  IPv6 2627093567      0t0  TCP *:10350 (LISTEN)
  #+end_example

* mix command
#+begin_src shell :dir "."
kubectl exec -it deploy/master mix do ecto.create, ecto.migrate
#+end_src

#+RESULTS:
#+begin_example
The database for Tmate.Repo has already been created

16:34:01.463 [info]  Already up
#+end_example
